distro-axis2/test/junit/org/apache/ode/itests/soap_to_bpel/soap-request-1.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope 
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:enc="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:loan="http://loans.org/wsdl/loan-approval">
  <env:Body>
    <loan:request1>
      <name>barnes</name>
      <amount>300</amount>
   </loan:request1>
  </env:Body>
</env:Envelope>

